# CLI tools
brew "gh"                          # GitHub command-line tool
brew "git"                         # Distributed revision control system
brew "nvm"                         # Manage multiple Node.js versions
brew "python@3.14"                 # Interpreted, interactive, object-oriented programming language
brew "pipenv"                      # Python dependency management tool
brew "postgresql@17"               # Object-relational database system
brew "powerlevel10k"               # Theme for Zsh
brew "pyenv"                       # Python version management
brew "react-native-cli"            # CLI for creating & managing React Native apps
brew "watchman"                    # File-watcher by Facebook, React Native hot-reload
brew "zsh-autosuggestions"         # Fish-like autosuggestions for Zsh
brew "zsh-fast-syntax-highlighting" # Feature-rich syntax highlighting for Zsh

# GUI apps (Casks)
cask "visual-studio-code"         # VS Code
cask "google-chrome"              # Chrome
cask "telegram"                   # Telegram
cask "xcode"                      # Xcode
cask "iterm2"                     # iTerm2
cask "sublime-text"               # Sublime Text
cask "claude"                     # Anthropic’s official Claude AI desktop app
cask "claude-code"                # Terminal-based AI coding assistant
cask "cursor"                     # Write, edit, and chat about your code with AI
cask "font-symbols-only-nerd-font" # Nerd Font for symbols/icons
cask "git-credential-manager"     # Git Credential Manager

# VS Code Extensions
vscode "anthropic.claude-code"
vscode "burkeholland.simple-react-snippets"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "equimper.react-native-react-redux"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "gruntfuggly.todo-tree"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.vscode-typescript-next"
vscode "msjsdiag.vscode-react-native"
vscode "redhat.vscode-yaml"
vscode "ryanolsonx.solarized"
