tap "beeftornado/rmtree"
tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/completions"
tap "homebrew/core"
tap "homebrew/dupes"
cask "xquartz"
brew "awscli"
brew "bash-completion"
brew "libpng"
brew "freetype"
brew "gettext"
brew "jpeg"
brew "libtiff"
brew "little-cms2"
brew "ghostscript"
brew "git"
brew "git-flow"
brew "hub"
brew "libtool"
brew "imagemagick"
brew "node"
brew "python"
brew "python3"
